FULL_NAME = {
    '79053116753':
        {
            'домбогородское': '*Вилла Богородское*',
            'домшапши': '*Высокая гора (шапшы)*',
        },
    '79063257387':
        {
            'малый': '*Голубое озеро №2 малый*',
            'большой': '*Голубое озеро №3*',
        },
    '79600363975':
        {
            'зеленыйминдаль': '*Голубое озеро №6*',
            'салмачи': '*Салмачи №1 Жк Вознесенье*',
        },
    '79377771034':
        {
            'деревянный': '*Дербышки №1 дер*',
            'кирпичный': '*Дербышки №2 кир*',
        },
    '79047619866':
        {
            'замок': '*Кадышего №1 VIP*',
            'сруб': '*Кадышего №2 дерево*',
            'дворец': '*Кадышего №3 дворец*',
        },
    '79656012318':
        {
            'бавария': '*Константиновка №1 Бавария*',
            'константиновка': '*Константиновка №3 хансувар*',
            'панорама': '*Конастантиновка №2 у озера*',
        },
    '79872711910':
        {
            'конcтантиновка': '*Константиновка №3 хансувар*',
        },
    '79872974084':
        {
            'амалый': '*Самосырова 5 малый*',
            'бсредний': '*Самосырова 6 средний*',
            'вбольшой': '*Самосырова 7 большой*',
        },
    '79274226911':
        {
            'чайка1': '*Щербаково 1 (Чайка)*',
            'чайка2': '*Щербаково 2*',
        },
    '79050212617':
        {
            'дом': '*Кульсеитово 1 ВИП*',
            'русская': '*Кульсеитово 2 Русский*',
            'охотничья': '*Кульсеитово 3 Охотничий*',
            'берег': '*Кульсеитово №7 Турецкий*',
            'парк': '*Кульсеитово №8*',
        },
    '79196237446':
        {
            "greenland": '*Гринленд*'
        },
    '79600482261':
        {
            'черемшановая23': '*Вознесенье №2 новый*'
        },
    '79377772077':
        {
            'калинино': '*Калинино*'
        },
    '79274180728':
        {
            'привольный': '*Привольный*'
        },
    '79600323247':
        {
            "мал56": '*Салмачи №7 Деревянный*',
            "малбас60": '*Салмачи №8 Деревянный с бассейном*',
            "больш58": '*Салмачи №10 VIP большой с бассейном*',
            "сред54": '*Салмачи №9 VIP средний*',
            "нов66": '*Салмачи №12  Премиум*',
            "новый66": '*Салмачи №12  Премиум*',

        },
    '79172290723':
        {
            "дачная128": '*Салмачи №11 Куюки*'
        },
    '79196224788':
        {
            'мира141': '*Самосырова 4*'
        },
    '79274358985':
        {
            'беломорская54': '*Северный 2*'
        },
    '79510675675':
        {
            'пулиха': '*Свияжскя Усадьба*'
        },
    '79178670299':
        {
            'а': '*Нагорный Сруб1*',
            'б': '*Нагорный сруб2*',
            'в': '*Нагорный сруб3*',
            'г': '*Нагорный сруб4*',
        },
    '79600421404':
        {
            'осиново': '*Осиново №1 У озера*'
        },
    '79867124227':
        {
            'отары2': '*Отары №2 Big Art*'
        },
    '79510675675':
        {
            'свусадьб': '*Свияжскя Усадьба*'
        },
    '79625515760':
        {
            'premium': '*Кощаково Premium*'
        },
    '79172795166':
        {
            'левченко': '*Левченко*'
        },
    '79872975991':
        {
            'лазаревка': '*Лазаревка*',
        },
    '79053129769':
        {
            'салмачи6': '*Салмачи №6 Вилла сальма*'
        },
    '79872970333':
        {
            'высгор': '*Высокая гора Премиум*'
        },
    '79047648223':
        {
            'вознесение': '*Вознесенье 5 малый*',
            'большой': '*Победилово у воды*',
            'малыйпобеда': '*Победилово у воды малый*',
        },
    '79172850892':
        {
            'первомай': '*Первомай',
        },
    '79196381354':
        {
            'зеленыйбор': '*Зелёный Бор',
        },
    '79061155445':
        {
            'овражная6': '*Богородское 2',
        },
    '79872971476-1481554579@g.us':
        {
            'к1': '*Константиновка #6*',
            'к3': '*Константиновка #7*',
            'к4': '*контантиновка #8*',
        },
    '79178767741-1419363809@g.us':
        {
            'банкетныйзал': '*Казанка Банкетный зал*',
            '1рыцарский': '*Новкая сосновка. Рыцар*',
            '2vip': '*Новая сосновка.Вип*',
            '3классический': '*Новая сосновка. Классич*',
            '4восточный1': '*Новая сосновка Восточный 1*',
            '5восточный2': '*Новая сосновка Восточный 2*',
            '6японский': '*Новая сосновка Японский*',
            '7гостевой': '*Новая сосновка Гостевой*',
            '8казанка': '*Казанка*',

        },
    '79655807679-1585037693@g.us':
        {
            'царский': '*Кадышево №4 голубое царский 50 чел*',
            'сосновый': '*Кадышево №5 голубое сосновый 30 чел*',
            'панорама': '*Кадышево №6 Беседка 80 чел*',
            'апартаменты': '*Кадышево №7 Аппартаменты*',
            'дятлово': '*Дятлово комплекс*',
        },
    '79655888066-1485072828@g.us':
        {
            'малый': '*Салмачи №2 Малый*',
            'большой': '*Салмачи №3 Японский*',
            '3новый': '*Салмачи №4 Новый*',
        },
    '79655896555-1527783737@g.us':
        {
            'малый': '*Самосырова 2*',
            'большой': '*Самосырова 3 Большой*',
        },
    '79655995118-1496687048@g.us':
        {
            'литвинова1а': '*Мишка на севере*'
        },
    '79172591019-1564744795@g.us':
        {
            'набережная3': '*Горнолыжка 1*',
            'нагоре/141': '*Горнолыжка 2*',
            'набережная4': '*Горнолыжка 3*',
        },
    '79046764175-1528129775@g.us':
        {
            'утренняя8а': '*Дербышки №5 охотничий*',
        },
    '79520308800-1503831959@g.us':
        {
            'мичурина117': '*Дербышки №3*'
        },
    '79872360002-1599913260@g.us':
        {
            'локомотив': '*Локомотив*'
        },
    '79600510471-1579437045@g.us':
        {
            'отары3': '*Отары №3 у озера*'
        },
    '79172998115-1568958489@g.us':
        {
            'петровский': '*Петровский*'
        },
    '79270394387-1557135797@g.us':
        {
            'салмачи5': '*Салмачи №5 Сосновая*'
        },
    '79272447447-1580997756@g.us':
        {
            'барский': '*Новая сосновка Барский*'
        },

}
