INFO = {
    '79053116753':
        {
            'домбогородское': {},
            'домшапши': {},
        },
    '79063257387':
        {
            'малый': {},
            'большой': {},
        },
    '79600363975':
        {
            'зеленыйминдаль': {},
            'салмачи': {},
        },
    '79377771034':
        {
            'деревянный': {},
            'кирпичный': {},
        },
    '79047619866':
        {
            'замок': {},
            'сруб': {},
            'дворец': {},
        },
    '79656012318':
        {
            'бавария': {},

            'панорама': {},
        },
    '79872711910':
        {
            'конcтантиновка': {},
        },
    '79510675675':
        {
            'пулиха': {}
        },
    '79872974084':
        {
            'амалый': {},
            'бсредний': {},
            'вбольшой': {},
            'новый': {},
        },
    '79274226911':
        {
            'чайка1': {},
            'чайка2': {},
        },
    '79050212617':
        {
            'дом': {},
            'русская': {},
            'охотничья': {},
            'берег': {},
            'парк': {},
        },
    '79196237446':
        {
            "greenland": {},
            'lighthouse': {}
        },
    '79370027008':
    {
        'конст10': {},
    },
    '79600482261':
        {
            'черемшановая23': {}
        },
    '79377772077':
        {
            'калинино': {}
        },
    '79274180728':
        {
            'новаявишневка': {}
        },
    '79600323247':
        {
            "мал56": {},
            "малбас60": {},
            "больш58": {},
            "сред54": {},
            "новый66": {},
            "нов66": {},

        },
    '79172290723':
        {
            "дачная128": {}
        },
    '79196224788':
        {
            'мира141': {}
        },
    '79178670299':
        {
            'а': {},
            'б': {},
            'в': {},
            'г': {},
        },
    '79600421404':
        {
            'осиново': {}
        },
    '79867124227':
        {
            'отары2': {}
        },
    '79510675675':
        {
            'свусадьб': {}
        },
    '79274358985':
        {
            'беломорская54': {}
        },
    '79625515760':
        {
            'premium': {}
        },
    '79172795166':
        {
            'левченко': {}
        },
    '79872975991':
        {
            'лазаревка': {}
        },
    '79053129769':
        {
            'салмачи6': {}
        },
    '79872970333':
        {
            'высгор': {}
        },
    '79047648223':
        {
            'вознесение': {},
            'большой': {},
            'малыйпобеда': {},
        },
    '79172850892':
        {
            'первомай': {}
        },
    '79196381354':
        {
            'зеленыйбор': {}
        },
    '79061155445':
        {
            'овражная6': {}
        },
    '79872971476-1481554579@g.us':
        {
            'к1': {},
            'к3': {},
            'к4': {},
        },
    '79178767741-1419363809@g.us':
        {
            'банкетныйзал': {},
            '1рыцарский': {},
            '2vip': {},
            '3классический': {},
            '4восточный1': {},
            '5восточный2': {},
            '6японский': {},
            '7гостевой': {},
            '8казанка': {},

        },
    '79655807679-1585037693@g.us':
        {
            'царский': {},
            'сосновый': {},
            'панорама': {},
            'апартаменты': {},
            'дятлово': {},
        },
    '79655888066-1485072828@g.us':
        {
            '4новый': {},
            '3малый': {},
            '2японский': {},
        },
    '79655896555-1527783737@g.us':
        {
            'малый': {},
            'большой': {},
        },
    '79655995118-1496687048@g.us':
        {
            'литвинова1а': {}
        },
    '79172591019-1564744795@g.us':
        {
            'набережная3': {},
            'нагоре/141': {},
            'набережная4': {},
        },
    '79046764175-1528129775@g.us':
        {
            'утренняя8а': {}
        },
    '79520308800-1503831959@g.us':
        {
            'мичурина117': {}
        },
    '79872360002-1599913260@g.us':
        {
            'локомотив': {}
        },
    '79600510471-1579437045@g.us':
        {
            'отарыуозера': {}
        },
    '79172998115-1568958489@g.us':
        {
            'петровский': {}
        },
    '79270394387-1557135797@g.us':
        {
            'салмачи5': {}
        },
    '79272447447-1580997756@g.us':
        {
            'барский': {}
        },
}


