from .table import table
import openpyxl
import requests
def parser(message, id):
    info={
        "Дом брогородское":{},
        "Дом Шапши":{},
        "Дятлово":{},
        "Набережная 3":{},
        "На Горе / 141":{},
        "Набережная, 4":{},
        "Малый":{},
        "Большой":{},
        "Зеленый Миндаль":{},
        "Деревянный":{},
        "Кирпичный":{},
        "Замок":{},
        "Сруб":{},
        "Дворец":{},
        "Царский":{},
        "Сосновый":{},
        "Панорама":{},
        "Апартаменты":{},
        "Бавария":{},
        "Панорама":{},
        "Контсантиновка":{},
        "к1":{},
        "к3":{},
        "к4":{},
        "дом":{},
        "русская":{},
        "охотничья":{},
        "берег":{},
        "парк":{},
        "Кощаково":{},
        "Занято":{},
        "8. Казанка":{},
        "Банкетный зал":{},
        "1.Рыцарский":{},
        2. Vip
        "3.":{},
        "4. Восточный 1":{},
        "5.Восточный 2":{},
        "6.Японский":{},
        "7.Гостевой":{},

        "А":{},
        "Б":{},
        "В":{},
        "Г":{},
        "Салмачи":{},
        "Малый":{},
        "Большой":{},
        "Новый":{},
        "Мал":{},
        "Мал.бас":{},
        "Сред":{},
        "Больш":{},
        "Новый":{},
        "Малый":{},
        "Большой":{},
        "А Малый":{},
        "Б Средний":{},
        "В Большой":{},
        "Чайка-1":{},
        "Чайка-2":{},

    }
    months=['январь','февраль','март','апрель','май',
            'июнь','июль','август','сентябрь',
            'октябрь','ноябрь','декабрь',
     ]
    message=message.replace("⛔", '')
    message=message.replace("\n", " ")
    message=message.replace(":", " ")
    message=message.replace(",", " ")
    message=message.replace("(", " ")
    message=message.replace(")", " ")
    message=message.replace("     ", " ")
    message=message.replace("    ", " ")
    message=message.replace("   ", " ")
    message=message.replace("  ", " ")

    house=""
    month=""
    for word in message.split(" "):
        if word in info:
            house=word
        else:
            if word in months:
                month=word.lower()
                info[house][month]=[]
            else:
                info[house][month].append(word)








